--MisDescBegin 任务定义信息开始，不要删除此行，客户端会自动分析读取 MisDescBegin 与 MisDescEnd 之间的内容
x808200_g_MissionName					= "百花缘"
x808200_g_MissionTarget					= "%f"
x808200_g_MissionKind					= 1
x808200_g_MissionLevel					= 10000
x808200_g_AccomplishNPC_Name			= "阿里"
x808200_g_SceneID						= 2
x808200_g_Position_X					= 185
x808200_g_Position_Z					= 65
x808200_g_MissionRound					= 358
x808200_g_DoubleExp						= 359
x808200_g_StrForePart					= 4
x808200_g_StrList						= {
"未找到的字符串",
"已找到遗失的小铲子 ： %s / 10",
"收集稀有的花盆 ： %s / 5",
"已采集百合花 ： %s / 3",
"已拜访 ： %s / 1",
"已找到扒鸡 ： %s / 1",
"已找到遗失的小铲子 ： %s / 5",	--策划将杀怪任务修改为任何怪都掉落，为了不给以前已存在的任务带来影响，这里新增一个类似任务 2009-12-16
"保留",
"保留",
"保留",
"保留",
"密探先锋",	"木人喽罗",	"木王蜘蛛",	"天山小雪怪",	"妖异心魔",	"腐体傀儡",	"灭妖傀儡",
"青旗探马", "木人精英",	"水王蜘蛛",	"天山大雪怪",	"破嗔心魔",	"蚀心傀儡",	"诛仙傀儡",
"蓝旗探马",	"木人武士",	"火王蜘蛛",	"天山雪怪王",	"杀欲心魔",	"化魄傀儡",	"弑神傀儡",
"光明殿",	"石刚",		"光明殿#{_INFOAIM95,160,11,石刚}石刚",
"少林寺",	"玄证",		"少林寺#{_INFOAIM99,145,9,玄证}玄证",
"星宿海",	"天璇子",	"星宿海#{_INFOAIM99,142,16,天璇子}天璇子",
"天山",		"邓婆",		"天山#{_INFOAIM95,148,17,邓婆}邓婆",
"武当山",	"萧天逸",	"武当山#{_INFOAIM100,181,12,萧天逸}萧天逸",
"凌波洞",	"公冶子长",	"凌波洞#{_INFOAIM44,125,14,公冶子长}公冶子长",
"天龙寺",	"本名",		"天龙寺#{_INFOAIM99,142,13,本名}本名",
"大理",		"段正淳",	"段正淳#{_INFOAIM71,18,2,段正淳}",
"洛阳",		"智清大师",	"智清大师#{_INFOAIM176,192,0,智清大师}",
"苏州",		"苏轼",		"苏轼#{_INFOAIM166,311,1,苏轼}",
}
x808200_g_FormatList					= {
"#{SDHDRW_091109_36}%s#{SDHDRW_091109_37}%s#{SDHDRW_091109_38}%s#{SDHDRW_091109_39}",
"#{SDHDRW_091109_36}%s#{SDHDRW_091109_40}%s#{SDHDRW_091109_39}",
"#{SDHDRW_091109_41}",
"#{SDHDRW_091109_36}%s#{SDHDRW_091109_42}%s#{SDHDRW_091109_43}",
"#{SDHDRW_091109_44}",
"#{SDHDRW_091109_36}%s#{SDHDRW_091216_01}%s#{SDHDRW_091109_39}",
}
--MisDescEnd 任务定义信息结束，不要删除此行，客户端会自动分析读取 MisDescBegin 与 MisDescEnd 之间的内容
