--MisDescBegin
x229015_g_ScriptId = 229015
x229015_g_Position_X=99
x229015_g_Position_Z=64
x229015_g_SceneID=521
x229015_g_AccomplishNPC_Name="唐清秋"
x229015_g_Name	= "唐清秋"
x229015_g_MissionId = 1300
x229015_g_MissionKind = 85
x229015_g_MissionLevel = 10000
x229015_g_IfMissionElite = 0
x229015_g_IsMissionOkFail = 0
x229015_g_MissionName="师门任务"
x229015_g_MissionInfo=""  --任务描述
x229015_g_MissionTarget = "%f"
x229015_g_ContinueInfo="做的不错"		--未完成任务的npc对话
x229015_g_MissionComplete="我交给你的事情已经做完了吗？"					--完成任务npc说话的话
x229015_g_MissionRound=17
x229015_g_DoubleExp = 48
x229015_g_AccomplishCircumstance = 1
x229015_g_ShimenTypeIndex = 1
x229015_g_Parameter_Kill_AllRandom={{id=7,numa=3,numb=3,bytenuma=0,bytenumb=1}}
x229015_g_Parameter_Item_IDRandom={{id=6,num=5}}
x229015_g_NpcIdIndicator={{key=2,npcIdIndex=5},{key=9,npcIdIndex=7}}
x229015_g_FormatList = {
"好久没有见到#R%n#W了，很是想念啊。这个#G%s#W是我的一点心意，请你把它送过去吧。#r  #G小提示：#G#r  你可以在唐家堡找到#G唐予诚#G#{_INFOAIM126,68,615,唐予诚}，请他把你送往各大城市。#G#r    任务完成后，请到师门任务发布人#G唐清秋#G#{_INFOAIM100,64,615,唐清秋}处交还任务。#r#{SMRW_090206_01}",
"我的#G%i#W怎么不见了？如果你能帮我找回来，我是不会亏待你的。#r  #G小提示：#G#r  你可以在唐家堡找到#G唐予诚#G#{_INFOAIM126,68,615,唐予诚}，请他把你送往各大城市。#G#r    任务完成后，请到师门任务发布人#G唐清秋#G#{_INFOAIM100,64,615,唐清秋}处交还任务。#r#{SMRW_090206_01}",
"#G%n#W为非作歹，我有心去教训一下，可惜没有时间，你能代劳吗？#r  #G小提示：#G#r  你可以在唐家堡找到#G唐予诚#G#{_INFOAIM126,68,615,唐予诚}，请他把你送往各大城市。#G#r    任务完成后，请到师门任务发布人#G唐清秋#G#{_INFOAIM100,64,615,唐清秋}处交还任务。#r#{SMRW_090206_01}",
"我唐家堡内刚刚设置了几鼎收集寒雪锻石的#Y%s#W，你可前往#G%s#W处使用此#Y%s#W将炉门开启，以便于唐门弟子收集锻石投入其中。#r  #G小提示：#G#r  当你来到需要开启的云炉附近时，你可以按#GAlt+A#G可以打开物品栏，点击#G“任务”#G页面就可以打开任务物品栏，右键点击#G金钥#G，就可以开启了。#G#r    任务完成后，请到师门任务发布人#G唐清秋#G#{_INFOAIM100,64,615,唐清秋}处交还任务。#r#{SMRW_090206_01}",
"请你去找到#R%s#W，他会带你去挑战#G%s#W的。#r  #G小提示：#G#r  你可以在唐家堡找到唐岳天#{_INFOAIM66,30,615,唐岳天}。#G#r    任务完成后，请到师门任务发布人#G唐清秋#G#{_INFOAIM100,64,615,唐清秋}处交还任务。#r#{SMRW_090206_01}",
"请你帮我抓一只#G%p#W来。#B#r  #G小提示：#r  #G唐家堡的唐予诚#{_INFOAIM126,68,615,唐予诚}#G可以送你去#G玄武岛#G，而#G玄武岛#G有一条小路通往#G圣兽山#G。你可以在#G玄武岛#G或者#G圣兽山#G上捕捉我需要的珍兽。#G#r    任务完成后，请到师门任务发布人#G唐清秋#G#{_INFOAIM100,64,615,唐清秋}处交还任务。#r#{SMRW_090206_01}",
"为了铸造我唐门威震武林的暗器，还需要你在唐家堡内四处走走，收集5个#G%s#W交给我吧！#r  #G小提示：#G#r  你可以在屏幕右上角的小地图上找到黄色的指示点。#G#r    任务完成后，请到师门任务发布人#G唐清秋#G#{_INFOAIM100,64,615,唐清秋}处交还任务。#r#{SMRW_090206_01}",
"请给#R%s#W送去一个#G%i#W吧，事成之后，我会给你报酬的！#r  #G小提示：#G#r  全冠清舵主就在丐帮总舵#{_INFOAIM120,63,10,全冠清}。#r  陈孤雁长老就在丐帮总舵#{_INFOAIM91,98,10,陈孤雁}。#r  吴长风长老就在丐帮总舵#{_INFOAIM114,91,10,吴长风}。#G#r    任务完成后，请到师门任务发布人#G唐清秋#G#{_INFOAIM100,64,615,唐清秋}处交还任务。#r#{SMRW_090206_01}",
"去杀死#G%s%s#W个#G%n#W。#r  #G小提示：#G#r  任务完成后，请到师门任务发布人#G唐清秋#W#{_INFOAIM100,64,615,唐清秋}处交还任务。#r#{SMRW_090206_01}",
"#{TMSM_130808_01}#G#r    任务完成后，请到师门任务发布人#G唐清秋#G#{_INFOAIM100,64,615,唐清秋}处交还任务。#r#{SMRW_090206_01}"
}
x229015_g_StrForePart=4
x229015_g_ShimenPet_Index = 1
x229015_g_StrList = {
"金钥",
"演武场#{_INFOAIM48,80,615,}",
"风羽楼#{_INFOAIM102,97,615,}",
"千机坊#{_INFOAIM56,136,615,}",
"唐家内堡#{_INFOAIM80,46,615,}",
"唐岳天",
"演武场副本",
"云鸩翎",
"青铜",
"寒雪锻石",
"全冠清",
"陈孤雁",
"吴长风",
"野生柴猫",
"云炉",
"0",
"1",
"2",
"3",
"4",
"5",
"6",
"7",
"8",
"9",
"演武场",
"风羽楼",
"千机坊",
"唐家内堡",
}
--MisDescEnd
