--MisDescBegin
x999312_g_ScriptId = 999312
x999312_g_Position_X = 182
x999312_g_Position_Z = 181
x999312_g_SceneID = 978
x999312_g_AccomplishNPC_Name = "岳老三" --门派任务发布人
x999312_g_Name = "岳老三"
x999312_g_MissionId = 3056
x999312_g_MissionKind = 147--任务类型 恶人谷
x999312_g_MissionLevel = 10000
x999312_g_IfMissionElite = 0
x999312_g_IsMissionOkFail = 0 --变量的第0位
x999312_g_MissionName = "师门任务"
x999312_g_MissionInfo = "" --任务描述
x999312_g_MissionTarget = "%f"
x999312_g_ContinueInfo = "干得不错" --未完成任务的npc对话
x999312_g_MissionComplete = "我交给你的事情已经做完了吗？" --完成任务npc说话的话
x999312_g_MissionRound = 17
x999312_g_DoubleExp = 48
x999312_g_AccomplishCircumstance = 1
x999312_g_ShimenTypeIndex = 1
x999312_g_Parameter_Kill_AllRandom = { { id = 7, numa = 3, numb = 3, bytenuma = 0, bytenumb = 1 } }
x999312_g_Parameter_Item_IDRandom = { { id = 6, num = 5 } }
x999312_g_NpcIdIndicator = { { key = 2, npcIdIndex = 5 }, { key = 9, npcIdIndex = 7 } }
x999312_g_FormatList = {
"    好久没有见到#R%n#W了，很是想念啊。这个#G%s#W是我的一点心意，请你把它送过去吧。#r  #G小提示：#G#r  你可以在恶人谷找到#G孙三霸#G#{_INFOAIM123,150,987,孙三霸}，请他把你送往各大城市。#G#r    任务完成后，请到师门任务发布人#G岳老三#G#{_INFOAIM183,181,987,岳老三}处交还任务。#r#{SMRW_090206_01}",
"    我的#G%i#W怎么不见了？如果你能帮我找回来，我是不会亏待你的。#r  #G小提示：#G#r  你可以在恶人谷找到#G孙三霸#G#{_INFOAIM123,150,987,孙三霸}，请他把你送往各大城市。#G#r    任务完成后，请到师门任务发布人#G岳老三#G#{_INFOAIM183,181,987,岳老三}处交还任务。#r#{SMRW_090206_01}",
"    #G%n#W为非作歹，我有心去教训一下，可惜没有时间，你能代劳吗？#r  #G小提示：#G#r  你可以在恶人谷找到#G孙三霸#G#{_INFOAIM123,150,987,孙三霸}，请他把你送往各大城市。#G#r    任务完成后，请到师门任务发布人#G岳老三#G#{_INFOAIM183,181,987,岳老三}处交还任务。#r#{SMRW_090206_01}",
"    #G%s#W敞亮舒适，适合放灯，你可前往#G%s#W处使用#Y%s#W放飞孔明灯，可静心祈福。#r  #G小提示：#G#r  当你来到适合放飞孔明灯附近时，你可以按#GAlt+A#G可以打开物品栏，点击#G“任务”#G页面就可以打开任务物品栏，右键点击#G孔明灯#G，就可以完成放飞了。#G#r    任务完成后，请到师门任务发布人#G岳老三#G#{_INFOAIM183,181,987,岳老三}处交还任务。#r#{SMRW_090206_01}",
"    请你去找到#R%s#W， 他会带你去挑战#G%s#W的。#r  #G小提示：#G#r  山鬼就在恶人谷#{_INFOAIM84,27,987,山鬼}。#G#r    任务完成后，请到师门任务发布人#G岳老三#G#{_INFOAIM183,181,987,岳老三}处交还任务。#r#{SMRW_090206_01}",
"    请你帮我抓一只#G%p#W来。#B#r  #G小提示：#G#r  #G恶人谷的孙三霸#{_INFOAIM123,150,987,孙三霸}可以送你去玄武岛，而玄武岛有一条小路通往圣兽山。你可以在玄武岛或者圣兽山上捕捉我需要的珍兽。#G#r    任务完成后，请到师门任务发布人#G岳老三#G#{_INFOAIM183,181,987,岳老三}处交还任务。#r#{SMRW_090206_01}",
"    请你在恶人谷上四处看看，帮我找来5个#G%s#W。#r  #G小提示：#G#r  你可以在屏幕右上角的小地图上找到黄色的指示点。#G#r    任务完成后，请到师门任务发布人#G岳老三#G#{_INFOAIM183,181,987,岳老三}处交还任务。#r#{SMRW_090206_01}",
"    请给#R%s#W送去一个#G%i#W吧，事成之后，我会给你报酬的！#r  #G小提示：#G#r  段延庆就在恶人谷#{_INFOAIM155,56,987,段延庆}。#r  叶二娘就在恶人谷#{_INFOAIM188,120,987,叶二娘}。#r  云中鹤就在恶人谷#{_INFOAIM79,162,987,云中鹤}。#G#r    任务完成后，请到师门任务发布人#G岳老三#G#{_INFOAIM183,181,987,岳老三}处交还任务。#r#{SMRW_090206_01}",--此任务不放出 可不修改
"    去杀死#G%s%s#W个#G%n#W。#r  #G小提示：#G#r    任务完成后，请到师门任务发布人#G岳老三#G#{_INFOAIM183,181,987,岳老三}处交还任务。#r#{SMRW_090206_01}",
"    去找到#R山鬼#W，他会带你去#G青崖山涧#W的。#r    #G小提示：山鬼就在恶人谷#{_INFOAIM84,27,987,山鬼}#G。#G#r    任务完成后，请到师门任务发布人#G岳老三#G#{_INFOAIM183,181,987,岳老三}处交还任务。#r#{SMRW_090206_01}",
} --替代
x999312_g_StrForePart = 4
x999312_g_ShimenPet_Index = 1
x999312_g_StrList = {
"孔明灯",
"盘山小径",
"云崖深处",
"奔流涧",
"苦情小筑",
"山鬼",
"青崖山涧",
"枯骨",
"鳄鱼蛋",
"一品红",
"望兽坪",
"云崖台",
"团山亭台",
"前庭",
"0",
"1",
"2",
"3",
"4",
"5",
"6",
"7",
"8",
"9",
"盘山小径#{_INFOAIM57,206,987,}",
"云崖深处#{_INFOAIM46,62,987,}",
"奔流涧#{_INFOAIM125,115,987,}",
"苦情小筑#{_INFOAIM178,126,987,}",
} --替代
--MisDescEnd
