--MisDescBegin
x888450_g_ScriptId = 888450
x888450_g_Position_X=245  --替代
x888450_g_Position_Z=191 --替代
x888450_g_SceneID=1148
x888450_g_AccomplishNPC_Name="七叔" --替代
x888450_g_Name	= "七叔" --替代
x888450_g_MissionId = 1965
x888450_g_MissionKind = 120
x888450_g_MissionLevel = 10000
x888450_g_IfMissionElite = 0
x888450_g_IsMissionOkFail = 0		--变量的第0位
x888450_g_MissionName="师门任务"
x888450_g_MissionInfo=""  --任务描述
x888450_g_MissionTarget = "%f"
x888450_g_ContinueInfo="干得不错"		--未完成任务的npc对话
x888450_g_MissionComplete="我交给你的事情已经做完了吗？"					--完成任务npc说话的话
x888450_g_MissionRound=17
x888450_g_DoubleExp = 48
x888450_g_AccomplishCircumstance = 1
x888450_g_ShimenTypeIndex = 1
x888450_g_Parameter_Kill_AllRandom={{id=7,numa=3,numb=3,bytenuma=0,bytenumb=1}}
x888450_g_Parameter_Item_IDRandom={{id=6,num=5}}
x888450_g_NpcIdIndicator={{key=2,npcIdIndex=5},{key=9,npcIdIndex=7}}
x888450_g_FormatList = {
"    好久没有见到#R%n#W了，很是想念啊。这个#G%s#W是我的一点心意，请你把它送过去吧。#r    #G小提示：#G#r    你可以在绝情谷找到#G谨行#G#{_INFOAIM243,252,824,谨行}，请他把你送往各大城市。#G#r    任务完成后，请到师门任务发布人#G七叔#G#{_INFOAIM245,191,824,七叔}处交还任务。#r    #{SMRW_090206_01}",
"    我的#G%i#W怎么不见了？如果你能帮我找回来，我是不会亏待你的。#r    #G小提示：#G#r    你可以在绝情谷找到#G谨行#G#{_INFOAIM243,252,824,谨行}，请他把你送往各大城市。#G#r    任务完成后，请到师门任务发布人#G七叔#G#{_INFOAIM245,191,824,七叔}处交还任务。#r    #{SMRW_090206_01}",
"    #G%n#W为非作歹，我有心去教训一下，可惜没有时间，你能代劳吗？#r    #G小提示：#G#r    你可以在绝情谷找到#G谨行#G#{_INFOAIM243,252,824,谨行}，请他把你送往各大城市。#G#r    任务完成后，请到师门任务发布人#G七叔#G#{_INFOAIM245,191,824,七叔}处交还任务。#r    #{SMRW_090206_01}",
"    #G%s#W敞亮清净，适于静心，你可前往#G%s#W处使用#Y%s#W进行抄书，可明心修德。#r    #G小提示：#G#r    当你来到抄书地点附近时，你可以按#GAlt+A#G可以打开物品栏，点击#G“任务”#G页面就可以打开任务物品栏，右键点击#G笔墨#G，就可以完成抄书了。#G#r    任务完成后，请到师门任务发布人#G七叔#G#{_INFOAIM245,191,824,七叔}处交还任务。#r    #{SMRW_090206_01}",
"    请你去找到#R%s#W， 他会带你去挑战#G%s#W的。#r    #G小提示：#G#r    穆宇就在绝情谷#{_INFOAIM256,142,824,穆宇}。#G#r    任务完成后，请到师门任务发布人#G七叔#G#{_INFOAIM245,191,824,七叔}处交还任务。#r    #{SMRW_090206_01}",
"    请你帮我抓一只#G%p#W来。#B#r    #G小提示：#G#r    #G绝情谷的谨行#{_INFOAIM243,252,824,谨行}可以送你去玄武岛，而玄武岛有一条小路通往圣兽山。你可以在玄武岛或者圣兽山上捕捉我需要的珍兽。#G#r    任务完成后，请到师门任务发布人#G七叔#G#{_INFOAIM245,191,824,七叔}处交还任务。#r    #{SMRW_090206_01}",
"    请你在#G绝情谷#W内四处看看，帮我找来#G5#W个#Y%s#W。#r    #G小提示：#G#r    枫糖可在听枫唱晚寻得，若想寻琉璃石与乌羽团扇，可前往灵乌苑看看。你也可以在屏幕右上角的小地图上找到黄色的指示点。#G#r    任务完成后，请到师门任务发布人#G七叔#G#{_INFOAIM245,191,824,七叔}处交还任务。#r    #{SMRW_090206_01}",
"    请给#R%s#W送去一个#G%i#W吧，事成之后，我会给你报酬的！#r    #G小提示：#G#r    行严就在绝情谷#{_INFOAIM258,168,824,行严}。#r    云骁就在绝情谷#{_INFOAIM231,170,824,云骁}。#r    凌绰就在绝情谷#{_INFOAIM281,170,824,凌绰}。#G#r    任务完成后，请到师门任务发布人#G七叔#G#{_INFOAIM245,191,824,七叔}处交还任务。#r    #{SMRW_090206_01}",
"    去杀死#G%s%s#W个#G%n#W。#r    #G小提示：#G#r    任务完成后，请到师门任务发布人#G七叔#G#{_INFOAIM245,191,824,七叔}处交还任务。#r    #{SMRW_090206_01}",
"    去找到#R穆宇#W，他会带你去#G三庭洞天#W的。#r    #G小提示：穆宇就在绝情谷#{_INFOAIM256,142,824,穆宇}#G。#G#r    任务完成后，请到师门任务发布人#G七叔#G#{_INFOAIM245,191,824,七叔}处交还任务。#r    #{SMRW_090206_01}",
} --替代
x888450_g_StrForePart=4
x888450_g_ShimenPet_Index = 1
x888450_g_StrList = {
"笔墨",
"听枫唱晚",
"断肠崖",
"灵乌苑",
"藏锋楼",
"穆宇",
"三庭洞天",
"乌羽团扇",
"枫糖",
"琉璃石",
"临水台",
"观景台",
"前院",
"楼前广场",
"0",
"1",
"2",
"3",
"4",
"5",
"6",
"7",
"8",
"9",
"听枫唱晚#{_INFOAIM369,327,824,}",
"断肠崖#{_INFOAIM258,33,824,}",
"灵乌苑#{_INFOAIM122,252,824,}",
"藏锋楼#{_INFOAIM278,251,824,}",
} --替代
--MisDescEnd
