--MisDescBegin
x000546_g_ScriptId = 000546
x000546_g_Position_X=159
x000546_g_Position_Z=78
x000546_g_SceneID=1124
x000546_g_AccomplishNPC_Name="萧声咽"
x000546_g_Name	= "萧声咽"
x000546_g_MissionId = 1915
x000546_g_MissionKind = 110
x000546_g_MissionLevel = 10000
x000546_g_IfMissionElite = 0
x000546_g_IsMissionOkFail = 0
x000546_g_MissionName="师门任务"
x000546_g_MissionInfo=""  --任务描述
x000546_g_MissionTarget = "%f"
x000546_g_ContinueInfo="做的不错"		--未完成任务的npc对话
x000546_g_MissionComplete="我交给你的事情已经做完了吗？"					--完成任务npc说话的话
x000546_g_MissionRound=17
x000546_g_DoubleExp = 48
x000546_g_AccomplishCircumstance = 1
x000546_g_ShimenTypeIndex = 1
x000546_g_Parameter_Kill_AllRandom={{id=7,numa=3,numb=3,bytenuma=0,bytenumb=1}}
x000546_g_Parameter_Item_IDRandom={{id=6,num=5}}
x000546_g_NpcIdIndicator={{key=2,npcIdIndex=5},{key=9,npcIdIndex=7}}
x000546_g_FormatList = {								
"    好久没有见到#R%n#W了，很是想念啊。这个#G%s#W是我的一点心意，请你把它送过去吧。#r  #G小提示：#G#r  你可以在桃花岛找到#G桃殷#G#{_INFOAIM256,169,731,桃殷}，请他把你送往各大城市。#G#r    任务完成后，请到师门任务发布人#G萧声咽#G#{_INFOAIM160,72,731,萧声咽}处交还任务。#r#{SMRW_090206_01}",
"    我的#G%i#W怎么不见了？如果你能帮我找回来，我是不会亏待你的。#r  #G小提示：#G#r  你可以在桃花岛找到#G桃殷#G#{_INFOAIM256,169,731,桃殷}，请他把你送往各大城市。#G#r    任务完成后，请到师门任务发布人#G萧声咽#G#{_INFOAIM160,72,731,萧声咽}处交还任务。#r#{SMRW_090206_01}",
"    #G%n#W为非作歹，我有心去教训一下，可惜没有时间，你能代劳吗？#r  #G小提示：#G#r  你可以在桃花岛找到#G桃殷#G#{_INFOAIM256,169,731,桃殷}，请他把你送往各大城市。#G#r    任务完成后，请到师门任务发布人#G萧声咽#G#{_INFOAIM160,72,731,萧声咽}处交还任务。#r#{SMRW_090206_01}",
"    #Y%s#W风景如画，你可前往#G%s#W处使用此#Y%s#W写生摹意，相信以心入境，定能有所感悟。#r  #G小提示：#G#r  当你来到需要写生的美景附近时，你可以按#GAlt+A#G可以打开物品栏，点击#G“任务”#G页面就可以打开任务物品栏，右键点击#G写生工具#G，就可以将大好山水尽收笔下。#G#r    任务完成后，请到师门任务发布人#G萧声咽#G#{_INFOAIM160,72,731,萧声咽}处交还任务。#r#{SMRW_090206_01}",
"    请你去找到#R%s#W，他会带你去挑战#G%s#W的。#r  #G小提示：#G#r你可以在桃花岛找到#G枕梦归#{_INFOAIM160,51,731,枕梦归}。#G#r    任务完成后，请到师门任务发布人#G萧声咽#G#{_INFOAIM160,72,731,萧声咽}处交还任务。#r#{SMRW_090206_01}",
"    请你帮我抓一只#G%p#W来。#B#r  #G小提示：#r  #G桃花岛#G的#R桃殷#W#{_INFOAIM256,169,731,桃殷}#G可以送你去#G玄武岛#G，而#G玄武岛#G有一条小路通往#G圣兽山#G。你可以在#G玄武岛#G或者#G圣兽山#G上捕捉我需要的珍兽。#G#r    任务完成后，请到师门任务发布人#G萧声咽#G#{_INFOAIM160,72,731,萧声咽}处交还任务。#r#{SMRW_090206_01}",
"    为准备每日晨祭，还需要你在桃花岛内四处寻觅，收集5个#G%s#W交给我吧！#r  #G小提示：#G#r  你可以在屏幕右上角的小地图上找到黄色的指示点。#G#r    任务完成后，请到师门任务发布人#G萧声咽#G#{_INFOAIM160,72,731,萧声咽}处交还任务。#r#{SMRW_090206_01}",
"    请给#R%s#W送去一个#G%i#W吧，事成之后，我会给你报酬的！#r  #G小提示：#G#r  全冠清舵主就在丐帮总舵#{_INFOAIM120,63,10,全冠清}。#r  陈孤雁长老就在丐帮总舵#{_INFOAIM91,98,10,陈孤雁}。#r  吴长风长老就在丐帮总舵#{_INFOAIM114,91,10,吴长风}。#G#r    任务完成后，请到师门任务发布人#G萧声咽#G#{_INFOAIM160,72,731,萧声咽}处交还任务。#r#{SMRW_090206_01}",
"    去击败#G%s%s#W个#G%n#W。#r  #G小提示：#G#r  任务完成后，请到师门任务发布人#G萧声咽#G#{_INFOAIM160,72,731,萧声咽}处交还任务。#r#{SMRW_090206_01}",
"    #{THSM_190727_1}#G#r    任务完成后，请到师门任务发布人#G萧声咽#G#{_INFOAIM160,72,731,萧声咽}处交还任务。#r#{SMRW_090206_01}",
}
x000546_g_StrForePart=4
x000546_g_ShimenPet_Index = 1
x000546_g_StrList = {
"写生工具",
"春闲情#{_INFOAIM181,175,731,}",
"一苇航#{_INFOAIM237,189,731,}",
"三问居#{_INFOAIM175,82,731,}",
"湛若水#{_INFOAIM112,135,731,}",
"枕梦归",
"三百迷津副本",
"离魂",
"幻海沉香木",
"忘忧果",
"全冠清",
"陈孤雁",
"吴长风",
"野生柴猫",
"长廊",
"0",
"1",
"2",
"3",
"4",
"5",
"6",
"7",
"8",
"9",
"春闲情",
"一苇航",
"三问居",
"湛若水",
"渡口",
"庭院",
"桃林",
}
--MisDescEnd
