--MisDescBegin
x892239_g_ScriptId = 892239
x892239_g_Position_X=96
x892239_g_Position_Z=98
x892239_g_SceneID=587
x892239_g_AccomplishNPC_Name="王玄风"
x892239_g_Name	= "王玄风"
x892239_g_MissionId = 1381
x892239_g_MissionKind = 96
x892239_g_MissionLevel = 10000
x892239_g_IfMissionElite = 0
x892239_g_IsMissionOkFail = 0
x892239_g_MissionName="师门任务"
x892239_g_MissionInfo=""  --任务描述
x892239_g_MissionTarget = "%f"
x892239_g_ContinueInfo="做的不错"		--未完成任务的npc对话
x892239_g_MissionComplete="我交给你的事情已经做完了吗？"					--完成任务npc说话的话
x892239_g_MissionRound=17
x892239_g_DoubleExp = 48
x892239_g_AccomplishCircumstance = 1
x892239_g_ShimenTypeIndex = 1
x892239_g_Parameter_Kill_AllRandom={{id=7,numa=3,numb=3,bytenuma=0,bytenumb=1}}
x892239_g_Parameter_Item_IDRandom={{id=6,num=5}}
x892239_g_NpcIdIndicator={{key=2,npcIdIndex=5},{key=9,npcIdIndex=7}}
x892239_g_FormatList = {
"    好久没有见到#R%n#W了，很是想念啊。这个#G%s#W是我的一点心意，请你把它送过去吧。#r  #G小提示：#G#r  你可以在鬼谷找到#G九日通#G#{_INFOAIM89,149,678,九日通}，请他把你送往各大城市。#G#r    任务完成后，请到师门任务发布人#G王玄风#G#{_INFOAIM96,98,678,王玄风}处交还任务。#r#{SMRW_090206_01}",
"    我的#G%i#W怎么不见了？如果你能帮我找回来，我是不会亏待你的。#r  #G小提示：#G#r  你可以在鬼谷找到#G九日通#G#{_INFOAIM89,149,678,九日通}，请他把你送往各大城市。#G#r    任务完成后，请到师门任务发布人#G王玄风#G#{_INFOAIM96,98,678,王玄风}处交还任务。#r#{SMRW_090206_01}",
"    #G%n#W为非作歹，我有心去教训一下，可惜没有时间，你能代劳吗？#r  #G小提示：#G#r  你可以在鬼谷找到#G九日通#G#{_INFOAIM89,149,678,九日通}，请他把你送往各大城市。#G#r    任务完成后，请到师门任务发布人#G王玄风#G#{_INFOAIM96,98,678,王玄风}处交还任务。#r#{SMRW_090206_01}",
"    #Y%s#W之水最具灵性，做法画符，俱是上品，你可前往#G%s#W处使用此#Y%s#W汲取瀑布之水，以供鬼谷弟子使用。#r  #G小提示：#G#r  当你来到需要取水的瀑布附近时，你可以按#GAlt+A#G可以打开物品栏，点击#G“任务”#G页面就可以打开任务物品栏，右键点击#G竹筒#G，就可以取水了。#G#r    任务完成后，请到师门任务发布人#G王玄风#G#{_INFOAIM96,98,678,王玄风}处交还任务。#r#{SMRW_090206_01}",
"    请你去找到#R%s#W，他会带你去挑战#G%s#W的。#r  #G小提示：#G#r你可以在鬼谷找到#G王栩之#{_INFOAIM96,52,678,王栩之}。#G#r    任务完成后，请到师门任务发布人#G王玄风#G#{_INFOAIM96,98,678,王玄风}处交还任务。#r#{SMRW_090206_01}",
"    请你帮我抓一只#G%p#W来。#B#r  #G小提示：#r  #G鬼谷#G的#R九日通#W#{_INFOAIM89,149,678,九日通}#G可以送你去#G玄武岛#G，而#G玄武岛#G有一条小路通往#G圣兽山#G。你可以在#G玄武岛#G或者#G圣兽山#G上捕捉我需要的珍兽。#G#r    任务完成后，请到师门任务发布人#G王玄风#G#{_INFOAIM96,98,678,王玄风}处交还任务。#r#{SMRW_090206_01}",
"    为修缮损坏的法坛，还需要你在鬼谷内四处走走，收集5个#G%s#W交给我吧！#r  #G小提示：#G#r  你可以在屏幕右上角的小地图上找到黄色的指示点。#G#r    任务完成后，请到师门任务发布人#G王玄风#G#{_INFOAIM96,98,678,王玄风}处交还任务。#r#{SMRW_090206_01}",
"    请给#R%s#W送去一个#G%i#W吧，事成之后，我会给你报酬的！#r  #G小提示：#G#r  全冠清舵主就在丐帮总舵#{_INFOAIM120,63,10,全冠清}。#r  陈孤雁长老就在丐帮总舵#{_INFOAIM91,98,10,陈孤雁}。#r  吴长风长老就在丐帮总舵#{_INFOAIM114,91,10,吴长风}。#G#r    任务完成后，请到师门任务发布人#G王玄风#G#{_INFOAIM96,98,678,王玄风}处交还任务。#r#{SMRW_090206_01}",
"    去杀死#G%s%s#W个#G%n#W。#r  #G小提示：#G#r  任务完成后，请到师门任务发布人#G王玄风#G#{_INFOAIM96,98,678,王玄风}处交还任务。#r#{SMRW_090206_01}",
"    #{GGSM_160624_10}#G#r    任务完成后，请到师门任务发布人#G王玄风#G#{_INFOAIM96,98,678,王玄风}处交还任务。#r#{SMRW_090206_01}"
}
x892239_g_StrForePart=4
x892239_g_ShimenPet_Index = 1
x892239_g_StrList = {
"竹筒",
"巫山境#{_INFOAIM40,100,678,}",
"玄狐苑#{_INFOAIM135,143,678,}",
"阴阳天东侧#{_INFOAIM125,70,678,}",
"观星台#{_INFOAIM60,42,678,}",
"王栩之",
"幻阵坪副本",
"八卦镜",
"令旗",
"六面法印",
"全冠清",
"陈孤雁",
"吴长风",
"野生柴猫",
"瀑布",
"0",
"1",
"2",
"3",
"4",
"5",
"6",
"7",
"8",
"9",
"巫山境",
"玄狐苑",
"阴阳天东侧",
"观星台",
}
--MisDescEnd
